tap 'thoughtbot/formulae'
tap 'homebrew/services'
tap 'homebrew/x11'
tap 'neovim/neovim'
tap 'jeffreywildman/homebrew-virt-manager'
cask_args appdir: '/Applications'

# Libs
brew 'openssl'
brew 'libxml2'

# Tools
brew 'ctags'
brew 'git'
brew 'rcm'
brew 'xz', args: ['universal']
brew 'the_silver_searcher'
brew 'tmux', args: ['HEAD']
brew 'zsh'
brew 'htop'
brew 'nmap'
brew 'ipcalc'
brew 'unrar'
brew 'dos2unix'
brew 'jq'

# Clients
brew 'hub'
brew 's3cmd'
brew 'awscli'
brew 'aws-shell'
cask 'xquartz'
brew 'freerdp'
brew 'syncthing', restart_service: :changed
brew 'mas'
brew 'virt-viewer'
brew 'virt-manager'
cask 'tunnelblick'
cask 'adium'
brew 'weechat', args: ['--with-aspell', '--with-curl', '--with-python', '--with-perl', '--with-ruby', '--with-lua', '--with-guile']
cask 'java' # required for squirrelsql
cask 'squirrelsql'

# Image manipulation
brew 'imagemagick'

# Testing
brew 'qt'

# Development
brew 'libyaml' # should come after openssl
brew 'node'
brew 'python'
brew 'python3'
brew 'neovim'
brew 'readline'
brew 'ruby-build'
brew 'crystal-lang', args: ['--with-llvm']

# Virtualization
brew 'xhyve', args: ['HEAD']
cask 'virtualbox', restart_service: :changed
cask 'vagrant'

# Databases
brew 'postgresql'
brew 'redis'
brew 'freetds'

# Utilities
brew 'reattach-to-user-namespace'
brew 'gnupg2'
brew 'gpg-agent'
mas 'LastPass', id: 926036361
mas 'Slack', id: 803453959
mas 'Todoist: To Do List | Task List', id: 585829637
cask 'google-chrome'
cask 'firefox'
cask 'adobe-reader'
cask 'mactex'
cask 'iterm2'
cask 'inkscape'
cask 'calibre'
cask 'teamviewer'
