tap 'thoughtbot/formulae'
tap 'homebrew/services'
tap 'linode/cli'
tap 'neovim/neovim'
tap 'jeffreywildman/homebrew-virt-manager'
tap 'caskroom/cask'
tap 'shopify/shopify'
tap 'wallix/awless'
tap 'beeftornado/rmtree'
tap 'getantibody/tap'
cask_args appdir: '/Applications'

# Libs
brew 'openssl'
brew 'readline'
brew 'zlib'
brew 'libxml2'

# Tools
brew 'ctags'
brew 'git'
brew 'git-flow-avh'
brew 'hg'
brew 'rcm'
brew 'xz', args: ['universal']
brew 'the_silver_searcher'
brew 'tmux'
brew 'zsh'
brew 'antibody'
brew 'htop'
brew 'glances'
brew 'nmap'
brew 'ipcalc'
brew 'unrar'
brew 'dos2unix'
brew 'jq'
brew 'pv'
brew 'lnav'
brew 'fasd'
brew 'gawk'
brew 'gnu-sed'
brew 'watch'
brew 'awless'

# Clients
brew 'hub'
brew 's3cmd'
brew 'awscli'
brew 'linode-cli'
brew 'aws-shell'
cask 'xquartz'
brew 'freerdp'
brew 'syncthing', restart_service: :changed
brew 'mas'
brew 'virt-manager'
brew 'virt-viewer'
brew 'themekit'
brew 'mobile-shell'
cask 'tunnelblick'
cask 'adium'
brew 'weechat', args: ['--with-aspell', '--with-curl', '--with-python', '--with-perl', '--with-ruby', '--with-lua', '--with-guile']
cask 'caskroom/versions/java8' # required for squirrelsql
cask 'squirrelsql'
cask 'pgadmin4'

# Image manipulation
brew 'imagemagick'

# Testing
brew 'qt'

# Development
brew 'libyaml' # should come after openssl
brew 'node'
brew 'neovim'
brew 'ruby-build'
cask 'android-studio'

# Virtualization
brew 'xhyve', args: ['HEAD']
cask 'virtualbox', restart_service: :changed
cask 'vagrant'

# Databases
brew 'postgresql'
brew 'redis'
brew 'freetds'

# Utilities
brew 'reattach-to-user-namespace'
brew 'gnupg2'
brew 'gpg-agent'
brew 'maxima'
mas 'LastPass', id: 926036361
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Todoist: To Do List | Task List', id: 585829637
mas 'Growl', id: 467939042
cask 'google-chrome'
cask 'firefox'
cask 'libreoffice'
cask 'mactex'
cask 'iterm2'
cask 'alacritty'
cask 'inkscape'
cask 'gimp'
cask 'calibre'
cask 'teamviewer'
cask 'playonmac'
