tap 'thoughtbot/formulae'
tap 'homebrew/services'
tap 'neovim/neovim'
tap 'jeffreywildman/homebrew-virt-manager'
tap 'shopify/shopify'
tap 'beeftornado/rmtree'
tap 'xwmx/taps'
cask_args appdir: '/Applications'

# Libs
brew 'openssl'
brew 'readline'
brew 'zlib'
brew 'libxml2'

# Tools
brew 'coreutils'
brew 'ctags'
brew 'git'
brew 'git-flow-avh'
brew 'git-delta'
brew 'bat'
brew 'bzip2'
brew 'hg'
brew 'rcm'
brew 'xz', args: ['universal']
brew 'the_silver_searcher'
brew 'tmux'
brew 'zsh'
brew 'htop'
brew 'glances'
brew 'nmap'
brew 'ipcalc'
brew 'telnet'
cask 'rar'
brew 'dos2unix'
brew 'jq'
brew 'pv'
brew 'lnav'
brew 'gawk'
brew 'gnu-sed'
brew 'watch'
brew 'pinentry-mac'

# Clients
brew 'yubikey-agent'
brew 'hub'
brew 's3cmd'
brew 'awscli'
brew 'aws-shell'
#cask 'xquartz'
#brew 'freerdp'
brew 'syncthing', restart_service: :changed
brew 'mas'
brew 'virt-manager'
brew 'virt-viewer'
brew 'themekit'
brew 'mosh'
# cask 'tunnelblick'
cask 'adium'
brew 'weechat'
cask 'homebrew/cask-versions/adoptopenjdk8' # required for squirrelsql
brew 'pgcli'
cask 'squirrelsql'
cask 'pgadmin4'
cask 'keepassxc'

# Image manipulation
brew 'imagemagick'

# Testing
brew 'qt'

# Development
brew 'libyaml' # should come after openssl
brew 'node'
brew 'neovim'
brew 'ruby-build'
# cask 'android-studio'

# Virtualization
cask 'virtualbox', restart_service: :changed
cask 'vagrant'

# Databases
brew 'postgresql'
brew 'redis'
brew 'freetds'

# Utilities
brew 'reattach-to-user-namespace'
brew 'gnupg'
brew 'maxima'
brew 'airport'
mas 'The Unarchiver', id: 425424353
cask 'alacritty'
# cask 'google-chrome'
# cask 'firefox'
cask 'libreoffice'
# cask 'visual-studio-code'
cask 'inkscape'
cask 'gimp'
cask 'teamviewer'
cask 'playonmac'
cask 'calibre'
#cask 'mactex'

